# IMPORTING LIBRARIES

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt


# Gathering Data

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

# Data Pre-Processing

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

In [6]:
df.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [7]:
df.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

# We Need pclass,sex and survived to find the accuracy of our designed model and predict the data . Pclass is about wheather the person is rich or poor. By this class we can a get an clear idea that which class poeple needs to survive.

# Data Preparation

In [8]:
df_x = df[["pclass","sex"]]
df_x.head()

   pclass     sex
0     1.0  female
1     1.0    male
2     1.0  female
3     1.0    male
4     1.0  female

In [10]:
df_x.isnull().sum()

pclass    1
sex       1
dtype: int64

In [11]:
df_x.shape

(1310, 2)

In [15]:
df_x = df_x.dropna(axis=0)

In [16]:
df_x.isnull().sum()

pclass    0
sex       0
dtype: int64

In [19]:
df_y = df[["survived"]]

In [20]:
df_y.isnull().sum()

survived    1
dtype: int64

In [21]:
df_y = df_y.dropna(axis = 0)

In [23]:
df_y.isnull().sum()

survived    0
dtype: int64

# Cleaning the Data

In [51]:
df_x["sex"].replace("male",1,inplace = True)
df_x["sex"].replace("female",0,inplace = True)
df_x.head()

   pclass  sex
0     1.0    0
1     1.0    1
2     1.0    0
3     1.0    1
4     1.0    0

# Importing Train test Split Model

In [28]:
from sklearn.model_selection import train_test_split

In [29]:
train_x,test_x,train_y,test_y = train_test_split(df_x,df_y,test_size = 0.2)

In [30]:
print(train_x)
print(train_y)

      pclass  sex
785      3.0    0
836      3.0    1
847      3.0    1
103      1.0    0
608      3.0    1
...      ...  ...
372      2.0    1
803      3.0    1
1151     3.0    0
1117     3.0    1
146      1.0    0

[1047 rows x 2 columns]
      survived
785        1.0
836        0.0
847        0.0
103        1.0
608        0.0
...        ...
372        0.0
803        0.0
1151       0.0
1117       0.0
146        1.0

[1047 rows x 1 columns]

# Trying with Random Forest Classifier Model

In [31]:
from sklearn.ensemble import RandomForestClassifier

In [32]:
rf = RandomForestClassifier()

In [33]:
rf.fit(train_x,train_y)

<ipython-input-33-de2c5cda62c5>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(train_x,train_y)

RandomForestClassifier()

# Finding accuracy for the trained Model we choosed

In [34]:
acc = rf.score(test_x,test_y)
print(acc*100)

74.04580152671755

# Trying with Logistic Regression Model

In [36]:
from sklearn.linear_model import LogisticRegression

In [38]:
lr = LogisticRegression()

In [39]:
lr.fit(train_x,train_y)

C:\Users\Nandan\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

# Finding the accuracy for the trained Model we choosed

In [40]:
acclr = lr.score(test_x,test_y)
print(acclr*100)

74.04580152671755

# Predicting the data from the Trained Models

In [41]:
prd = rf.predict(test_x)

In [42]:
prd

array([0., 0., 1., 1., 0., 0., 0., 0., 1., 0., 1., 1., 0., 0., 1., 1., 0.,
       1., 1., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 1.,
       0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0., 1., 0., 0.,
       0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 0., 1., 0., 0.,
       0., 1., 0., 0., 1., 0., 0., 0., 1., 1., 1., 0., 0., 1., 1., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 1., 0., 1., 0., 1.,
       0., 0., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0., 1.,
       0., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.,
       0., 0., 0., 0., 1., 1., 1., 0., 1., 1., 0., 0., 0., 0., 1., 1., 0.,
       0., 1., 1., 1., 0., 0., 1., 0., 1., 0., 1., 1., 1., 0., 1., 1., 1.,
       1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0.,
       1., 0., 1., 1., 0., 0., 1., 1., 0., 0., 0., 0., 1., 1., 1., 0., 0.,
       1., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 0., 1., 0., 1., 0.,
       0., 0., 1., 0., 0., 0., 1., 1., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       1., 0., 0., 1., 1., 0., 0., 1., 0., 1., 0., 0., 0., 1., 0., 1., 1.,
       1., 1., 1., 1., 1., 0., 1.])

In [47]:
op = test_x[['pclass']]
op['survived'] = prd

# Predicted Data

In [52]:
op

     pclass  survived
874     3.0       0.0
931     3.0       0.0
122     1.0       1.0
436     2.0       1.0
674     3.0       0.0
..      ...       ...
807     3.0       1.0
296     1.0       1.0
218     1.0       1.0
378     2.0       0.0
12      1.0       1.0

[262 rows x 2 columns]

In [53]:
op.head()

     pclass  survived
874     3.0       0.0
931     3.0       0.0
122     1.0       1.0
436     2.0       1.0
674     3.0       0.0

In [54]:
test_y.head()

     survived
874       1.0
931       0.0
122       1.0
436       1.0
674       1.0